#include"H_calculator.h"

void Catalog()                        //目录
{
	printf("---------------------------------------------------------\n");
	printf("-----------------老哥，输入你要计算的式子叭--------------\n");
	printf("-----------------  只能简单的四则运算哦    --------------\n");
	printf("-----------------      没搞出小数点的      --------------\n");
	printf("-----------------     太难我可不会qwq      --------------\n");
	printf("----------------- 输入q就是退出这个计算器  --------------\n");
	printf("-----------------        请慎输入！        --------------\n");
	printf("---------------------------------------------------------\n");
}

int Priority(char a, char b)                           //判断符号优先级,a为当前读入，b为栈顶元素 
{
	int c;                                     //c反馈指令信息 
											   //0.结束 1.弹出 2.进栈
	switch (a)                                 //3.删除当前元素及栈顶元素 4.报错
	{
	case '#':if (b == '#') c = 0;
			else c = 1; break;
	case '+':if (b == '#' || b == '(') c = 2;
			else c = 1; break;
	case '-':if (b == '#' || b == '(') c = 2;
			else c = 1; break;
	case '*':if (b == '*' || b == '/') c = 1;
			else c = 2; break;
	case '/':if (b == '*' || b == '/') c = 1;
			else c = 2; break;
	case '(':c = 2; break;
	case ')':if (b == '(') c = 3;
			else c = 1; break;
	default:c = 4; break;
	}
	return c;
}